Repository: common-repository/simple-seo-criteria-check
Catalog: languages/simple-seo-criteria-check-*.po
Languages: de_de

source: Images
de_de: Bilder

source: Images and Image Meta Data
de_de: Bilder und Bilder Metadaten

source: Check Images and related image data
de_de: Prüfe Bilder und zugehörige Bilddaten

source: SEO Tip: Image Files should contain keywords and should be extended by additional meta data, such as an Alt attribute
de_de: SEO Tipp: Bildnamen sollten Keywords und zusätzliche Metadaten beinhalten, wie z. B. ein Alt Text (Alternativtext)

source: Image Alt Tag:
de_de: Bild Alt Text:

source: of
de_de: von

source: total images have an image alt tag
de_de: Bildern insgesamt beinhalten einen Bild Alttext

source: Image Content:
de_de: Bildbeschreibung:

source: total images have an image content
de_de: Bildern insgesamt beinhalte Bildbeschreibung

source: Related Post/Page
de_de: Zugehörige(r) Post/Seite

source: Excerpt
de_de: Beschriftung

source: File Name
de_de: Dateiname

source: edit Post
de_de: bearbeite Post

source: edit Image Data
de_de: bearbeite Bilddaten

source: show Image
de_de: zeige Bild

source: Internal/External Links
de_de: Interne/externe Links

source: Internal and External Post Links
de_de: Interne und externe Postlinks

source: Check posts for internal and external links in content
de_de: Prüfe Posts nach internen und externen Links in der Beschreibung

source: Internal Links:
de_de: Interne Links:

source: total posts have internal links
de_de: Posts insgesamt beinhalten interne Links

source: External Links:
de_de: Externe Links:

source: total posts have external links
de_de: Posts insgesamt beinhalten externe Links

source: Total Internal
de_de: Gesamt Intern

source: Internal Links
de_de: Interne Links

source: Total External
de_de: Gesamt Extern

source: External Links
de_de: Externe Links

source: Permalink of your posts
de_de: Permalinks der Posts

source: Check for SEO friendly URLs
de_de: Prüfe nach SEO freundlichen URLs

source: Check post's permalink lenght of URL.
de_de: Prüfe die Länge des Post-Permalinks.

source: The shorter the URL the better for Ranking
de_de: Je kürzer die URL desto besser für das Ranking

source: Check also for keywords within permalink
de_de: Prüfe Keywords-Vorkommnisse im Permalink

source: Use 3 to 5 words within a permalink
de_de: Verwende 3 bis 5 Wörter in einem Permalink

source: Length of Permalink
de_de: Permalink-Länge

source: Full Permalink
de_de: Vollständiger Permalink

source: Lenght of URL
de_de: URL-Länge

source: edit
de_de: bearbeiten
